app/views/users/show.html.erb

  <h2>Most Recent Bottle</h2>
  <% if @user.addresses.count > 0 %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  ORDER BY "addresses"."id" DESC LIMIT 1  [["user_id", 3]]
SELECT COUNT(*) FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 4]]