app/controllers/transactions_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."btc_address" = ?  [["btc_address", "mhYRguvNTHNhFvEF2uQVQmgQPhVttvYAWq"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
  def create
      @transaction = Transaction.new
      previous_address = Address.where(btc_address: params[:address][:sending_btc_address]).first
      previous_btc = previous_address.btc_address
      if Transaction.get_balance(previous_btc)
        if params[:address][:user_id].blank? # cannot sell to no listed user
          redirect_to request.referrer
          flash[:notice] = "Please choose a user."
        else # if there is a valid recipient
          recipient = User.find(params[:address][:user_id])