app/controllers/users_controller.rb

  def show
    @user = current_user
    if @user.stringified_location.blank?
      @user.stringified_location = "#{@user.city}, #{@user.state}, #{@user.country}"
      @user.save
    end
    @current_bottles = current_user.addresses.where(is_sold: false)
    @former_bottles = current_user.addresses.where(is_sold: true)
    @all_users = User.all
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."is_sold" = 't'  [["user_id", 4]]
SELECT "users".* FROM "users"